In [1]:
#import library
%matplotlib inline
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
#import Ta-Feng Grocery with containing data from 01/11/2000 until 28/02/2001
Tafeng_data = pd.read_csv("/content/drive/MyDrive/PROYEK/Proyek DAMI/ta_feng_all_months_merged.csv")
Tafeng_data.head()

  TRANSACTION_DT  CUSTOMER_ID AGE_GROUP  ... AMOUNT  ASSET  SALES_PRICE
0      11/1/2000      1104905     45-49  ...      2     24           30
1      11/1/2000       418683     45-49  ...      1     48           46
2      11/1/2000      1057331     35-39  ...      2    142          166
3      11/1/2000      1849332     45-49  ...      1     32           38
4      11/1/2000      1981995     50-54  ...      1     14           18

[5 rows x 9 columns]

#Exploratory Data Analysis

In [3]:
#Display 10 sample data
Tafeng_data.sample(10)

       TRANSACTION_DT  CUSTOMER_ID AGE_GROUP  ... AMOUNT  ASSET  SALES_PRICE
653086       2/7/2001      1770285     40-44  ...      1    146          199
59685       11/8/2000       533089       NaN  ...      1     79           94
290452      12/4/2000        10801     35-39  ...      2    114          170
43006       11/6/2000      2086187     25-29  ...      1     75           99
515129      1/18/2001      1764093     30-34  ...      1     21           32
167272     11/25/2000      1626797     40-44  ...      2     56           72
36917       11/5/2000        29421     45-49  ...      1     44           52
324706     12/14/2000       239530     35-39  ...      1     58           85
307774     12/13/2000      1600223     45-49  ...      1     44           49
146560     11/20/2000      2082950     25-29  ...      1     23           29

[10 rows x 9 columns]

In [4]:
#Display descriptive statistics
Tafeng_data.describe()

        CUSTOMER_ID  PRODUCT_SUBCLASS  ...          ASSET    SALES_PRICE
count  8.177410e+05     817741.000000  ...  817741.000000  817741.000000
mean   1.406620e+06     284950.495933  ...     112.109848     131.875589
std    7.489784e+05     226390.701451  ...     603.661776     631.057633
min    1.069000e+03     100101.000000  ...       0.000000       1.000000
25%    9.692220e+05     110106.000000  ...      35.000000      42.000000
50%    1.587722e+06     130106.000000  ...      62.000000      76.000000
75%    1.854930e+06     520314.000000  ...     112.000000     132.000000
max    2.000200e+07     780510.000000  ...  432000.000000  444000.000000

[8 rows x 6 columns]

In [5]:
#Check for missing values in the dataset
Tafeng_data.isnull().sum(axis=0)

TRANSACTION_DT          0
CUSTOMER_ID             0
AGE_GROUP           22362
PIN_CODE                0
PRODUCT_SUBCLASS        0
PRODUCT_ID              0
AMOUNT                  0
ASSET                   0
SALES_PRICE             0
dtype: int64

In [6]:
#Check the shape (number of columns and rows) in the dataset
Tafeng_data.shape

(817741, 9)

In [7]:
#Customer distribution by age group
age_group_cust_data=Tafeng_data[['AGE_GROUP', 'CUSTOMER_ID']].drop_duplicates()
age_group_cust_data.groupby(['AGE_GROUP'])['CUSTOMER_ID'].aggregate('count').reset_index().sort_values('CUSTOMER_ID', ascending= False)

  AGE_GROUP  CUSTOMER_ID
2     35-39         6588
1     30-34         5916
3     40-44         5084
4     45-49         3723
0     25-29         3196
5     50-54         2184
8       <25         1630
9       >65         1363
6     55-59         1076
7     60-64          880

In [8]:
Tafeng_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 817741 entries, 0 to 817740
Data columns (total 9 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   TRANSACTION_DT    817741 non-null  object
 1   CUSTOMER_ID       817741 non-null  int64
 2   AGE_GROUP         795379 non-null  object
 3   PIN_CODE          817741 non-null  object
 4   PRODUCT_SUBCLASS  817741 non-null  int64
 5   PRODUCT_ID        817741 non-null  int64
 6   AMOUNT            817741 non-null  int64
 7   ASSET             817741 non-null  int64
 8   SALES_PRICE       817741 non-null  int64
dtypes: int64(6), object(3)
memory usage: 56.1+ MB

In [9]:
numerical_vars = ['TRANSACTION_DT','CUSTOMER_ID', 'AGE_GROUP', 'PIN_CODE', 'PRODUCT_SUBCLASS', 'PRODUCT_ID', 'AMOUNT', 'ASSET', 'SALES_PRICE']

In [10]:
Tafeng_data['SALES_PRICE'].describe()

count    817741.000000
mean        131.875589
std         631.057633
min           1.000000
25%          42.000000
50%          76.000000
75%         132.000000
max      444000.000000
Name: SALES_PRICE, dtype: float64

In [11]:
Tafeng_data['TRANSACTION_DT'].describe()

count        817741
unique          120
top       1/21/2001
freq          21129
Name: TRANSACTION_DT, dtype: object

In [12]:
Tafeng_data['CUSTOMER_ID'].describe()

count    8.177410e+05
mean     1.406620e+06
std      7.489784e+05
min      1.069000e+03
25%      9.692220e+05
50%      1.587722e+06
75%      1.854930e+06
max      2.000200e+07
Name: CUSTOMER_ID, dtype: float64

In [13]:
#Customer distribution by transaction date
transaction_cust_data=Tafeng_data[['TRANSACTION_DT', 'CUSTOMER_ID']].drop_duplicates()
transaction_cust_data.groupby(['TRANSACTION_DT'])['CUSTOMER_ID'].aggregate('count').reset_index().sort_values('CUSTOMER_ID', ascending= False)

   TRANSACTION_DT  CUSTOMER_ID
14      1/22/2001         2232
13      1/21/2001         2079
49     11/26/2000         1785
48     11/25/2000         1709
34     11/12/2000         1653
..            ...          ...
76     12/23/2000          132
73     12/20/2000          118
74     12/21/2000          105
75     12/22/2000           81
71     12/19/2000           73

[120 rows x 2 columns]

#Data Preprocessing

In [14]:
#Remove missing values from CUSTOMER_ID column
#We can ignore missing values in description column
Tafeng_data = Tafeng_data[pd.notnull(Tafeng_data['CUSTOMER_ID'])]

In [15]:
#Check validation, if there are any negative values in AMOUNT column
Tafeng_data.AMOUNT.min()

1

In [16]:
#Check validation, if there are any negative values in SALES_PRICE column
Tafeng_data.SALES_PRICE.min()

1

In [17]:
#Filter out data with negative values
Tafeng_data = Tafeng_data[(Tafeng_data["AMOUNT"] > 0)]

In [18]:
#Convert the string date field to datetime
Tafeng_data['TRANSACTION_DT'] = pd.to_datetime(Tafeng_data['TRANSACTION_DT'])

In [19]:
Tafeng_data.head()

  TRANSACTION_DT  CUSTOMER_ID AGE_GROUP  ... AMOUNT  ASSET  SALES_PRICE
0     2000-11-01      1104905     45-49  ...      2     24           30
1     2000-11-01       418683     45-49  ...      1     48           46
2     2000-11-01      1057331     35-39  ...      2    142          166
3     2000-11-01      1849332     45-49  ...      1     32           38
4     2000-11-01      1981995     50-54  ...      1     14           18

[5 rows x 9 columns]

In [20]:
print("Summary...")
#exploring the unique values of each attribute
print("Number of transactions:", Tafeng_data['SALES_PRICE'].nunique())
print("Number of products bought:", Tafeng_data['PRODUCT_ID'].nunique())
print("Number of customers:", Tafeng_data['CUSTOMER_ID'].nunique())
print("Percentage of customers NA:", round(Tafeng_data['CUSTOMER_ID'].isnull().sum()*100/len(Tafeng_data),2),"%")

Summary...
Number of transactions: 2191
Number of products bought: 23812
Number of customers: 32266
Percentage of customers NA: 0.0 %